{
    "presentation": {
        "Title": "Introduction",
        "Subtitle1": "From Sports to the World of Coding: My Amazing Journey!",
        "Subtitle2": "A New Beginning",
        "Subtitle3": "Explore My Digital World",
        "Subtitle4": "Ready for New Challenges",
        "Paragraph2": "Hello and welcome to my portfolio! I'm excited to show you my work in making computer programs. I live in La Colle-Sur-Loup, and I recently finished my studies at Bocal Academy in Nice.",
        "Paragraph3": "Before I started making websites, I really liked playing sports. Those years taught me about never giving up, working in a team, and trying my best. Because of that, I decided to learn about computers and make things on the internet. That's how I started my computer journey, and I worked on different computer things for 5 years.",
        "Paragraph4": "Something great happened when I got to work at Alithya for the RegardBTP project. In that group, I learned about Angular and SpringBoot Java, and how to work together well. I also did my own projects, 'Cosplay Maker' and 'Spotifake', using MongoDB, Express, React, and Node.js.",
        "Paragraph6": "My different journey lets me see computer stuff in a special way. I'm excited to keep learning and growing in this changing field. I always like to try new things! If you want to work on websites with me, just send a message to cassandra.forestier@hotmail.fr."
    },
    "menu": {
        "LinkToPresentation": "Presentation",
        "LinkToProjects": "Projects",
        "LinkToContact": "Contact",
        "LinkToResume": "CV",
        "LinkToStudies": "Studies",
        "LinkToExperiences": "Experiences",
        "LinkToAllProjects": "All projects",
        "LinkToCosplayMaker": "Cosplay-Maker project",
        "LinkToSpotifake": "Spotifake project",
        "LinkToMyTools": "My toolbox"
    },
    "studies": {
        "Title": "My Studies",
        "moreInformation": "More informations",
        "Subtitle1": "Application Developer Designer",
        "Subtitle2": "Bachelor's Degree in Computer Science (Work-Study Program)",
        "Subtitle3": "Bachelor's Degree in Adapted Physical Activities and Health",
        "Subtitle4": "High School Diploma in Science",
        "paragraphAdditionnal": "Professional Title RNCP 31678",
        "Paragraph1": "School: Le Bocal Academy, Nice",
        "ParagraphSubtile1": "Worked at Alithya as part of an assignment at RegardBTP",
        "Paragraph2": "School: IUT of Sophia-Antipolis, Sophia-Antipolis",
        "ParagraphSubtile2": "Worked at SAP Labs France as part of an internship",
        "Paragraph3": "School: Faculty of Sports and Physical Education, Liévin",
        "ParagraphSubtile3": "Bachelor's Degree in Adapted Physical Activities and Health",
        "Paragraph4": "School: Marguerite Yourcenar High School, Beuvry",
        "ParagraphSubtile4": "With honors",
        "date1": "September 2022 - July 2023",
        "date2": "September 2017 - July 2019",
        "date3": "September 2012 - July 2015",
        "date4": "September 2009 - July 2012"
    },
    "experiences": {
        "Title": "Experiences",
        "Subtitle1": "Web Developer Analyst",
        "Subtitle2": "Systems Analyst",
        "Subtitle3": "Technical Lead/On-Site Technician",
        "Subtitle4": "Level 2 User Support",
        "Paragraph1": "Alithya, Sophia-Antipolis",
        "ParagraphSubtile1": "Apprenticeship at RegardBTP",
        "experience1": {
            "list": {
                "bullet1": "Successful migration from Angular 9.1 to Angular 12.4.",
                "bullet2": "Identification and resolution of code issues using SonarQube, including problematic code, code smells, and critical errors on Angular.",
                "bullet3": "Improved test coverage for Angular using Karma.",
                "bullet4": "Complete migration of a 'Arbitrage' page from JSP to Angular.",
                "bullet5": "Implemented Swagger on SpringBoot for clear API documentation.",
                "bullet6": "Developed an administration feature for adding and visualizing pages via Swagger on SpringBoot, using Oracle as the database, with associated Junit tests.",
                "bullet7": "Implemented an aspect-oriented system on SpringBoot to measure response times of each request in logs."
            }
        },
        "experience3": {
            "informationList1": "Skills for IT Technician Level 2:",
            "List1": {
                "bullet1": "Management of Hardware and Software incidents through tickets (GLPI / Ivanti)",
                "bullet2": "Knowledge of Windows operating system",
                "bullet3": "Management of an Airwatch Server & phone enrollment",
                "bullet4": "On-site Hardware assistance with users",
                "bullet5": "Usage of Microsoft Office / 365 / SCCM / AD suite",
                "bullet6": "PC Imaging"
            },
            "informationList2": "Skills for Technical Lead / Team Leader:",
            "List2": {
                "bullet1": "Coordination of technician activities",
                "bullet2": "Operational management of field technicians across subsidiaries",
                "bullet3": "Facilitation of technical committee meetings",
                "bullet4": "Ensuring and participating in procedure enhancements",
                "bullet5": "Management of IT stock / IT and phone park",
                "bullet6": "Onboarding of new collaborators",
                "bullet7": "Detection and prevention of potential global incidents",
                "bullet8": "Dedicated VIP support",
                "bullet9": "SLA tracking on ticketing tool and weekly reporting"
            }
        },
        "Paragraph2": "Alithya, Sophia-Antipolis",
        "ParagraphSubtile2": "Assignment at ProBTP",
        "paragraph2information": "Management of Hardware and Software incidents through tickets (Footprints / Service Now)",
        "Paragraph3": "Experis, Sophia Antipolis",
        "ParagraphSubtile3": "Assignment at V. Mane & Fils",
        "Paragraph4": "SAP Labs France, Sophia-Antipolis",
        "ParagraphSubtile4": "Apprenticeship at SAP Labs France",
        "date1": "September 2022 - August 2023",
        "date2": "March 2021 - September 2022",
        "date3": "September 2019 - September 2020",
        "date4": "July 2017 - September 2019"
    },
    "cosplaymaker": {
        "description": "The goal of this project is to provide a platform for cosplayers to plan, manage, and share their cosplays.",
        "paragraph-desc": "Here, you will find the PowerPoint presentation created for the project defense, as well as the report.",
        "paragraph-desc2": "I completed this project independently within 6 months as part of my training at Bocal Academy, Nice. As a cosplayer myself, this project is close to my heart. I was able to apply my knowledge in React, NodeJS, Express, MongoDB, Ant Design, Git, Github, and even Docker. I hope this project can come to fruition. It's something I would like to continue developing, as I believe it can be beneficial to the cosplay community. Feel free to explore the code available on my Github repository.",
        "github-link": "Github repository",
        "technologies": "Technologies used",
        "database-card": "Database",
        "mobile-application-card": "Mobile application",
        "download": "Download the report/the PowerPoint",
        "download-report": "Download the report",
        "download-powerpoint": "Download the PowerPoint"
    },
    "spotifake": {
        "description": "Spotifake offers a music streaming experience. Logged-in users can discover albums, listen to and manage their favorite music.",
        "paragraph-desc": "This is a project we completed in 1 month and 1 week (the final week was dedicated to deploying the web application on an EC2 instance). There were 4 of us working on this assigned project. We began with requirement analysis, functional and technical analysis, and then created a project plan. We established project management methods (Kanban board, tech lead, rules, and best practices, etc.). I was able to apply my knowledge in React, NodeJS, Express, MongoDB, Material UI, Git, Github, Docker, and even worked with AWS S3 buckets. Deploying the site on an EC2 instance was a highly rewarding experience, allowing me to understand the necessary steps and adaptations to make the site accessible for everyone. Feel free to explore the code available on my Github repository.",
        "github-link": "Github repository",
        "technologies": "Technologies used",
        "database": "Database"
    },
    "footer": {
        "navigation": "Navigation",
        "followMe": "Follow me",
        "myResume": "My resume",
        "contactMe": "Contact me",
        "driver": "Car owner, Driver's License B",
        "sector": "Sector: Alpes-Maritimes (06)",
        "form": "Form",
        "send": "Send",
        "name": "Your name and surname",
        "message": "Your message"
    },
    "toolbox": {
        "postman-desc": "A powerful tool for testing APIs. I started the project by setting up the back-end CRUD operations. Postman allows sending HTTP requests (GET, POST, PUT, and DELETE for my use case). You can define headers, parameters, request body, and even necessary authentications using it. This will enable me, in the future, to share this Workspace with people who will join the project.",
        "vscode-desc": "One of the most evident choices for my projects is the use of VS Code. VS Code is one of the most popular IDEs and one of the easiest to get started with. So, it was clear that I would lean towards this choice. Moreover, throughout the year, I've customized the settings of VS Code to match my preferences and needs, thanks to the numerous extensions available.",
        "docker-desc": "Docker Desktop enables me to see my locally launched MongoDB container. This allows me to automatically start the container whenever I launch my project.",
        "mongodb-desc": "MongoDB Compass is a graphical interface that enables interaction with my local database. It allows me to check schemas, verify the functionality of CRUD operations, and even verify data hashes. It's a tool that simplifies verification, particularly during my manual tests.I can also manage my database documents directly from this interface, making real- time modifications or even deletions if necessary.",
        "github-desc": "GitHub is a platform for hosting and sharing code, where my project resides, allowing me to version code, track changes, establish development workflows using GitHub Actions, share with other developers, create a comprehensive Readme.md, and utilize GitHub Actions for workflow automation.",
        "jira-desc": "Jira is a project management tool that I use to manage my project's tasks. It allows me to create tasks, assign them to myself or other developers, and track their progress. I can also create sprints and epics to organize my tasks. I can also create a backlog of tasks that I can add to my sprints. Finally, I can create a roadmap to visualize the progress of my project.",
        "sendgrid-desc": "SendGrid is a tool that allows me to send emails to users. I use it to send emails to users when they register or when they forget their password.",
        "snyk-desc": "Snyk is a tool that helps analyze the security of dependencies in projects. It detects known vulnerabilities in third-party libraries used in a project. If it detects that any of the third-party libraries have been updated, it automatically creates a pull request on GitHub with all the necessary information. This allows for an automated analysis of the third-party software components in the project, enabling me to implement Software Composition Analysis (SCA).",
        "internship": "Internship context tools",
        "internship-desc": "During my internship, I used several tools that I don't use anymore. However, I think it's important to mention them because they were essential to the project's success. I used the following tools: Spring Tool Suite, Eclipse, Maven, SonarQube, Jenkins, Oracle SQL Developer"
    },
    "project": {
        "more-info": "More informations",
        "github-link": " Github repository",
        "project-title": "My projects"
    }
}