{
    "presentation": {
        "Title": "Présentation",
        "Subtitle1": "Du sport à l'univers du code : mon voyage épique !",
        "Subtitle2": "Un Nouveau Chapitre",
        "Subtitle3": "Explorez mon univers numérique",
        "Subtitle4": "Prête à relever de nouveaux défis",
        "Paragraph2": "Bonjour et bienvenue sur mon portfolio ! Je suis ravie de vous accueillir dans mon espace dédié à ma passion pour le développement d'applications. Je suis une Conceptrice Développeuse d'Applications basée à La Colle-Sur-Loup, et j'ai récemment obtenu mon titre au Bocal Academy à Nice.",
        "Paragraph3": "Avant de me lancer dans le développement Web, j'ai consacré une partie de ma vie à mon amour pour le sport. Ces années passées dans l'univers du sport m'ont appris l'importance de la persévérance, de l'esprit d'équipe et du dépassement de soi. Forte de cette expérience, j'ai décidé de canaliser cette énergie dans le monde numérique. C'est ainsi que mon voyage dans l'informatique a commencé, j'ai fait 5 ans de missions diverses en tant que technicienne informatique.",
        "Paragraph4": "La chance m'a souri lorsque j'ai eu l'opportunité d'être en alternance chez Alithya pour la mission RegardBTP. Au sein de cette équipe, j'ai exploré les complexités d'Angular et de SpringBoot Java, tout en respectant les méthodes Agile / Scrum. Cette période a également été marquée par mon investissement dans des projets personnels, 'Cosplay Maker' et 'Spotifake', construits avec la stack MERN (MongoDB, Express, React, Node.js).",
        "Paragraph6": "Mon parcours atypique et diversifié me permet d'apporter une perspective unique au développement d'applications. J'ai hâte de continuer à apprendre, grandir et contribuer dans ce domaine en constante évolution. Je suis toujours partante pour relever des défis passionnants! Si vous êtes prêt(e) à vous embarquer dans une aventure web avec moi, faites-moi signe! Envoyez un signal à cassandra.forestier@hotmail.fr"
    },
    "menu": {
        "LinkToPresentation": "Présentation",
        "LinkToProjects": "Projets",
        "LinkToContact": "Contact",
        "LinkToResume": "CV",
        "LinkToStudies": "Mes études",
        "LinkToAllProjects": "Tous les projets",
        "LinkToCosplayMaker": "Projet Cosplay-Maker",
        "LinkToSpotifake": "Projet Spotifake",
        "LinkToMyTools": "Boite à outils"
    },
    "studies": {
        "Title": "Mes études",
        "moreInformation": "Plus d'informations",
        "Subtitle1": "Concepteur développeur d'Applications",
        "Subtitle2": "DUT Informatique en alternance",
        "Subtitle3": "Licence Activités Physiques Adaptées et de Santé",
        "Subtitle4": "Baccalauréat Scientifique",
        "paragraphAdditionnal": "Titre professionnel RNCP 31678",
        "Paragraph1": "Ecole : Le Bocal Academy, Nice",
        "ParagraphSubtile1": "En alternance chez Alithya pour une mission chez RegardBTP",
        "Paragraph2": "Ecole : IUT de Sophia-Antipolis, Sophia-Antipolis",
        "ParagraphSubtile2": "En alternance chez SAP Labs France",
        "Paragraph3": "Ecole : Faculté des sports et de l'éducation physique, Liévin",
        "ParagraphSubtile3": "Licence Activités Physiques Adaptées et de Santé",
        "Paragraph4": "Ecole : Lycée Marguerite Yourcenar, Beuvry",
        "ParagraphSubtile4": "Avec mention",
        "date1": "Septembre 2022 - juillet 2023",
        "date2": "Septembre 2017 - juillet 2019",
        "date3": "Septembre 2012 - juillet 2015",
        "date4": "Septembre 2009 - juillet 2012"
    },
    "cosplaymaker": {
        "description": "Le but de ce projet est de fournir une plateforme permettant aux cosplayers de planifier, gérer et partager leurs cosplays.",
        "paragraph-desc": "Ici, vous trouverez le Powerpoint fait pour la soutenance de ce projet ainsi que le rapport.",
        "paragraph-desc2": "C'est un projet que j'ai réalisé seule, en 6mois, dans le cadre de ma formation au Bocal Academy, Nice. Il s'agit d'un projet qui me tient à coeur car je suis moi-même cosplayer et j'ai pu mettre en pratique mes connaissances en React, NodeJS, Express, MongoDB, Ant Design, Git, Github, et même Docker. J'espère que ce projet va pouvoir aboutir. Il s'agit d'un projet que j'aimerais continuer à développer, car, je pense, qu'il peut être utile à la communauté cosplay. C'est donc avec plaisir que vous pouvez visiter le code disponible sur mon Github.",
        "github-link": "Lien vers le Github",
        "technologies": "Technologies utilisées",
        "database-card": "Base de données",
        "mobile-application-card": "Application mobile",
        "download": "Télécharger le rapport/le Powerpoint",
        "download-report": "Télécharger le rapport",
        "download-powerpoint": "Télécharger le Powerpoint"
    },
    "spotifake": {
        "description": " Spotifake permet d'offrir une expérience musicale. Les utilisateurs connectés pourront découvrir des albums, écouter et gérer leur musique préférée.",
        "paragraph-desc": "C'est un projet que nous avons réalisés sur 1 mois et 1 semaine (la dernière semaine consistant à mettre en ligne l'application Web sur une instance EC2). Nous étions donc 4 à travailler sur ce sujet imposé. Nous avons fait d'abord une étude des besoins, une analyse fonctionnelle et technique, puis nous avons réalisé un planning. puis nous avons établie la façon dont nous allions gérer le projet (tableau Kanban, tech lead, règles et bonnes pratiques ...). J'ai pu mettre en pratique mes connaissances en React, NodeJS, Express, MongoDB, Material UI, Git, Github, Docker, mais aussi l'utilisation d'un Bucket S3 d'AWS. La mise en ligne du site sur une instance EC2 a été une expérience très enrichissante, j'ai pu voir ce qu'il fallait mettre en place et adapter pour que le site soit accessible à tous. C'est donc avec plaisir que vous pouvez visiter le code disponible sur mon Github.",
        "github-link": "Lien vers le Github",
        "technologies": "Technologies utilisées",
        "database": "Base de données"
    },
    "footer": {
        "navigation": "Navigation",
        "followMe": "Me suivre",
        "myResume": "Mes informations",
        "contactMe": "Contactez-moi",
        "driver": "Véhiculée, Permis B",
        "sector": "Secteur : Alpes-Maritimes (06)",
        "form": "Formulaire",
        "send": "Envoyer",
        "name": "Votre nom et prénom",
        "message": "Votre message"
    },
    "toolbox": {
        "postman-desc": "Un outil puissant pour tester les API. J'ai démarré le projet en mettant en place les opérations CRUD côté back-end. Postman permet d'envoyer des requêtes HTTP (GET, POST, PUT et DELETE dans mon cas d'utilisation). Vous pouvez définir les en-têtes, les paramètres, le corps de la requête et même les authentifications nécessaires à l'aide de cet outil. Cela me permettra, à l'avenir, de partager cet espace de travail avec les personnes qui rejoindront le projet.",
        "vscode-desc": "L'un des choix les plus évidents pour ce projet est l'utilisation de VS Code. VS Code est l'un des IDE les plus populaires et l'un des plus faciles à prendre en main. Il était donc évident que je m'orienterais vers ce choix. De plus, tout au long de l'année, j'ai personnalisé les paramètres de VS Code pour correspondre à mes préférences et besoins, grâce aux nombreuses extensions disponibles.",
        "docker-desc": "Docker Desktop me permet de voir mon conteneur MongoDB lancé localement. Cela me permet de démarrer automatiquement le conteneur à chaque fois que je lance mon projet.",
        "mongodb-desc": "MongoDB Compass est une interface graphique qui permet d'interagir avec ma base de données en local. Il me permet de vérifier les schémas, de vérifier si les opérations CRUD fonctionnent correctement et même de vérifier les hachages de données. C'est un outil qui facilite la vérification, notamment pendant mes tests manuels. Je peux également gérer directement les documents de ma base de données depuis cette interface, ce qui me permet d'apporter des modifications en temps réel, voire même de les supprimer si nécessaire.",
        "github-desc": "GitHub est une plateforme pour héberger et partager du code, où mon projet réside, me permettant de versionner le code, suivre les modifications, établir des workflows de développement via GitHub Actions, partager avec d'autres développeurs, créer un Readme.md détaillé, et utiliser GitHub Actions pour l'automatisation des flux de travail.",
        "jira-desc": "Jira est un outil de gestion de projet que j'utilise pour gérer les tâches de mes projets. Il me permet de créer des tâches, de les assigner à moi-même ou à d'autres développeurs, et de suivre leur avancement. Je peux également créer des sprints et des épopées pour organiser mes tâches. Je peux aussi créer un backlog de tâches que je peux ajouter à mes sprints. Enfin, je peux créer une feuille de route pour visualiser la progression de mon projet.",
        "sendgrid-desc": "SendGrid est un outil qui me permet d'envoyer des e-mails aux utilisateurs. Je l'utilise pour envoyer des e-mails aux utilisateurs lors de leur inscription ou lorsqu'ils oublient leur mot de passe.",
        "snyk-desc": "Snyk est un outil permettant d'analyser la sécurité des dépendances dans les projets. Il permet de détecter les vulnérabilités connues dans les bibliothèques tierces utilisées dans un projet. S'il détecte qu'une des bibliothèques tierces a été mise à jour, il créé automatiquement un pull request sur GitHub avec toutes les informations nécessaires.Cela permet donc une analyse automatisée de la composition des logiciels tiers sur le projet et cela me permet donc de mettre en place le SCA.",
        "internship": "Les outils utilisés en alternance",
        "internship-desc": "Pendant mon alternance, j'ai utilisé plusieurs outils que je n'utilise plus aujourd'hui. Cependant, je pense qu'il est important de les mentionner car ils étaient essentiels à la réussite du projet. J'ai utilisé les outils suivants : Spring Tool Suite, Eclipse, Maven, SonarQube, Jenkins, Oracle SQL Developer."
    },
    "project": {
        "more-info": "En savoir plus",
        "github-link": " Lien Github",
        "project-title": "Mes projets"
    }
}